package Sachko.core;

public class Test {
    public static final int ADDITIONAL_MS = 122;

    public static void main(String[] args) {
        String SubtitleText = "1\n" +
                "00:00:26,469 --> 00:00:29,907\n" +
                "<i>Тук е бежански кораб от Асгард.</i>\n" +
                "\n" +
                "2\n" +
                "00:00:33,242 --> 00:00:36,890\n" +
                "<i>Нападнаха ни.\n" +
                "Повтарям, нападнаха ни.</i>\n" +
                "\n" +
                "3\n" +
                "00:00:37,164 --> 00:00:39,929\n" +
                "<i>Двигателите не работят,\n" +
                "системите ни са извън строя...</i>\n" +
                "\n" +
                "4\n" +
                "00:00:41,031 --> 00:00:45,172\n" +
                "<i>Молим за помощ\n" +
                "от всеки кораб в обхвата ни.</i>\n" +
                "\n" +
                "5\n" +
                "00:00:47,906 --> 00:00:50,551\n" +
                "<i>На кораба има предимно\n" +
                "асгардски семейства,</i>\n" +
                "\n" +
                "6\n" +
                "00:00:50,651 --> 00:00:52,651\n" +
                "<i>и много малко войници.</i>\n" +
                "\n" +
                "7\n" +
                "00:00:52,751 --> 00:00:56,971\n" +
                "<i>Това не е военен кораб.\n" +
                "Повтарям, не е военен кораб.</i>\n" +
                "\n" +
                "8\n" +
                "00:01:09,703 --> 00:01:12,921\n" +
                "Чуйте ме... и се радвайте!\n" +
                "\n" +
                "9\n" +
                "00:01:16,507 --> 00:01:21,788\n" +
                "Имахте привилегията\n" +
                "да бъдете спасени от Великия Титан.\n" +
                "\n" +
                "10\n" +
                "00:01:24,481 --> 00:01:27,035\n" +
                "Може да мислите, че това е страдание.\n" +
                "\n" +
                "11\n" +
                "00:01:27,919 --> 00:01:31,731\n" +
                "Не, това е спасение.\n" +
                "\n" +
                "12\n" +
                "00:01:36,268 --> 00:01:42,088\n" +
                "Везните на Вселената се балансират\n" +
                "заради вашата саможертва.\n" +
                "\n" +
                "13\n" +
                "00:01:43,503 --> 00:01:47,774\n" +
                "Усмихнете се, че дори и в смъртта си,\n" +
                "\n" +
                "14\n" +
                "00:01:48,074 --> 00:01:51,011\n" +
                "вие станахте деца на Танос.\n" +
                "\n" +
                "15\n" +
                "00:02:06,012 --> 00:02:08,917\n" +
                "Знам какво е да губиш.\n" +
                "\n" +
                "16\n" +
                "00:02:10,353 --> 00:02:13,853\n" +
                "Така отчаяно да знаеш, че си прав\n" +
                "\n" +
                "17\n" +
                "00:02:13,953 --> 00:02:16,361\n" +
                "и все пак да се провалиш.\n" +
                "\n" +
                "18\n" +
                "00:02:24,816 --> 00:02:29,862\n" +
                "И когато го осъзнаеш,\n" +
                "краката ти омекват.\n" +
                "\n" +
                "19\n" +
                "00:02:31,939 --> 00:02:34,993\n" +
                "И питам, защо?\n" +
                "\n" +
                "20\n" +
                "00:02:35,548 --> 00:02:38,829\n" +
                "Бягаш ужасен от нея...\n" +
                "\n" +
                "21\n" +
                "00:02:39,091 --> 00:02:41,653\n" +
                "но съдбата винаги те застига.\n" +
                "\n" +
                "22\n" +
                "00:02:42,716 --> 00:02:46,958\n" +
                "И сега тя е тук.\n" +
                "Или по-точно...\n" +
                "\n" +
                "23\n" +
                "00:02:48,458 --> 00:02:50,489\n" +
                "Аз съм тук.\n" +
                "\n" +
                "24\n" +
                "00:02:55,127 --> 00:02:57,322\n" +
                "Много говориш.\n" +
                "\n" +
                "25\n" +
                "00:02:57,947 --> 00:03:02,181\n" +
                "Тесаракта.\n" +
                "Или главата на брат ти.\n" +
                "\n" +
                "26\n" +
                "00:03:06,594 --> 00:03:08,836\n" +
                "Предполагам, имаш предпочитание?\n" +
                "\n" +
                "27\n" +
                "00:03:09,976 --> 00:03:12,001\n" +
                "О, да. Имам.\n" +
                "\n" +
                "28\n" +
                "00:03:14,023 --> 00:03:16,058\n" +
                "Да го убиеш.\n" +
                "\n" +
                "29\n" +
                "00:03:30,205 --> 00:03:32,253\n" +
                "Добре, спри!\n" +
                "\n" +
                "30\n" +
                "00:03:34,970 --> 00:03:39,180\n" +
                "Тесаракта не е в нас.\n" +
                "Беше унищожен в Асгард.\n" +
                "\n" +
                "31\n" +
                "00:03:50,704 --> 00:03:53,360\n" +
                "Ти наистина си най-лошият брат.\n" +
                "\n" +
                "32\n" +
                "00:03:57,533 --> 00:04:01,892\n" +
                "Уверявам те, братко.\n" +
                "Слънцето отново ще свети за нас.\n" +
                "\n" +
                "33\n" +
                "00:04:03,407 --> 00:04:06,775\n" +
                "Оптимизмът ти не е на място,\n" +
                "асгардиецо.\n" +
                "\n" +
                "34\n" +
                "00:04:06,875 --> 00:04:11,086\n" +
                "Първо, не съм асгардиец.\n" +
                "\n" +
                "35\n" +
                "00:04:11,186 --> 00:04:13,198\n" +
                "И второ...\n" +
                "\n" +
                "36\n" +
                "00:04:14,146 --> 00:04:16,330\n" +
                "имаме си Хълк.\n" +
                "\n" +
                "37\n" +
                "00:04:28,010 --> 00:04:30,308\n" +
                "Остави го да се позабавлява.\n" +
                "\n" +
                "38\n" +
                "00:05:21,805 --> 00:05:23,855\n" +
                "Предци мои...\n" +
                "\n" +
                "39\n" +
                "00:05:25,128 --> 00:05:29,979\n" +
                "Нека черната магия\n" +
                "потече за последен път.\n" +
                "\n" +
                "40\n" +
                "00:05:45,124 --> 00:05:47,138\n" +
                "Това беше грешка.\n" +
                "\n" +
                "41\n" +
                "00:05:52,456 --> 00:05:54,529\n" +
                "Не!\n" +
                "\n" +
                "42\n" +
                "00:06:03,280 --> 00:06:06,318\n" +
                "Ще умреш заради това!\n" +
                "\n" +
                "43\n" +
                "00:06:17,232 --> 00:06:19,638\n" +
                "Моята смирена личност...\n" +
                "\n" +
                "44\n" +
                "00:06:20,490 --> 00:06:24,279\n" +
                "коленичи пред твоето величие.\n" +
                "\n" +
                "45\n" +
                "00:06:25,951 --> 00:06:29,521\n" +
                "Никое друго същество\n" +
                "не е имало мощта,\n" +
                "\n" +
                "46\n" +
                "00:06:29,621 --> 00:06:32,292\n" +
                "нито благородството,\n" +
                "\n" +
                "47\n" +
                "00:06:32,392 --> 00:06:36,927\n" +
                "да владее не един,\n" +
                "а два Камъка на Вечността.\n" +
                "\n" +
                "48\n" +
                "00:06:39,757 --> 00:06:44,835\n" +
                "Вселената е в твоите ръце.\n";

        fixLine(SubtitleText);
    }

    public static String fixLine(String string) {
        int index = string.indexOf('0'); //index of changes
        int indexForStartOfSubstringLeft = index + 9;
        int indexForEndOfSubstringLeft = index + 12;
        String string2 = string.substring(indexForStartOfSubstringLeft, indexForEndOfSubstringLeft);
        int leftSidedSeconds = Integer.parseInt(string2);
        int indexForStartOfSubstringRight = index + 26;
        int indexForEndOfSubstringRight = index + 29;
        String string3 = string.substring(indexForStartOfSubstringRight, indexForEndOfSubstringRight);
        int rightSidedSeconds = Integer.parseInt(string3);
        String oldLeftSidedSecondsString =  Integer.toString(leftSidedSeconds);
        String oldRightSidedSecondsString =  Integer.toString(rightSidedSeconds);
        leftSidedSeconds = leftSidedSeconds + ADDITIONAL_MS;
        rightSidedSeconds = rightSidedSeconds + ADDITIONAL_MS;
        String newLeftSidedSecondsString =  Integer.toString(leftSidedSeconds);
        String newRightSidedSecondsString =  Integer.toString(rightSidedSeconds);
        string = string.replace(oldLeftSidedSecondsString, newLeftSidedSecondsString);
        string = string.replace(oldRightSidedSecondsString, newRightSidedSecondsString);
        return string;
    }
}
